fe40/tutorials/rheoTestFoam/HerschelBulkley/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 1;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss upwind; //Dummy: select anyone (phi=0)
}

laplacianSchemes
{
    default         none;      
}

interpolationSchemes
{
    default         linear;
      
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default         no;
}

// ************************************************************************* //
